app/Controllers/Auth.php

    public function cek()
    {
        // Ambil data dari form
        $data = $this->request->getVar();

        // Ambil data user di database yang usernamenya sama
        $user = $this->UserModel->where('username', $data['username'])->first();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'denikurnia11'
 LIMIT 1